a = int(input("Введите трёхзначное число: "))
if a >= 100 and a < 1000:
    a1 = a // 100
    a2 = a // 10 % 10
    a3 = a % 10
    if a1 + a2 + a3 > 9 and a1 + a2 + a3 < 100:
        print("сумма - двузначное")
    else:
        print("сумма - не двузначное")
    if a1 * a2 * a3 > 99 and a1 * a2 * a3 < 1000:
        print("произведение - трехзначное")
    else:
        print("произведение - не трехзначное")
    if a1 * a2 * a3 > a:
        print("произведение больше а")
    else:
        print("произведение меньше а")
    if a1 + a2 + a3 % 5 == 0:
        print("кратна 5")
    else:
        print("не кратна 5")
    if a1 + a2 + a3 % a == 0:
        print("кратна а")
    else:
        print("не кратна а")
else:
    print("число не трехзначное")
